{
    "pages": [
        {
            "tags": "",
            "text": "Want to know me at a glance? Check out what I usually read! I am graduated in electrical and computer engineering from Ferdowsi University of Mashhad, Iran. Currently, I am following my interests in the areas of machine learning and software science. Interests Applied machine learning Computer vision Internet of Things Big data Software science Want to know me at a glance? Check out what I usually read!",
            "title": "About",
            "url": "/about.html"
        },
        {
            "tags": "",
            "text": "MSc Electrical and Computer Engineering, 2019 Ferwodsi University of Mashhad, Iran During my MSc program, I took a veriety of courses concerning software and hardware of processing architectures. In software related domain, I had advanced computer architecture and fualt tolerant systems design. I used what I leart in both courses directly in my collaborations with industrial R&D labs (for more information see projects). My thesis dealt with a study on heterogeneous FPGA architectures. Its goal was to find an optimum configuration of a soft-core processor without doing the actual synthesis and implementation steps on hardware. CGPA: 88% BSc Electrical and Computer Engineering, 2016 Ferdowsi University of Mashhad, Iran My BSc was my first step to realize the underneath layers of the mysterious technology. There were lots of courses in analog and digital design. Although all of the courses sound amazing, I found myself interested in digital domain. My final project was implementation of a simple data trasmitter over visible light. CGPA: 91%",
            "title": "Education",
            "url": "/education.html"
        },
        {
            "tags": "",
            "text": "I am graduated in electrical and computer engineering from Ferdowsi University of Mashhad, Iran. Currently, I am following my interests in the areas of machine learning and software science. Interests I am eagerly following interdisciplinary works with machine learning. Want to know me at a glance? Check out what I usually read! News August 2021               Working on a new version of my personal webpage!",
            "title": "Mahdi Shourabi",
            "url": "/index.html"
        },
        {
            "tags": "",
            "text": "Academic Using deep learning to detect ophthalmic diseases, 2021 Traditionally, ophthalmologists had to take images from patients' eye with specific instruments, and analyze those images manually to detect any possible anomaly in the eye. The goal of project was to exploit deep learning methods to do the detection phase automatically. That is deep layers of neurons will be trained to classify images obtained from ophthalmology instruments. The results show that a well tuned deep network along with a large enough dataset can accurately detect the anomalies. This model in turn can be used in smartphones to help opticians in the disorder detection.",
            "title": "Projects",
            "url": "/projects.html"
        },
        {
            "tags": "",
            "text": "Shourabi, M., & Noori, H. (2021). Design Space Exploration based on deep learning and hardware performance counters to predict the optimal configuration of a soft-core processor. Abstract Click on this to see abstract. By the ever-increasing complexity of hardware processing architectures, CAD tools, and low-level simulation techniques no more can address the design gap issue. So, the need for high-level prediction will be more tangible. This paper presents a methodology to help designers find the optimum energy-consuming configuration of a softcore processor at a glance and with appreciable accuracy. The proposed framework extracts the integrated performance counters information within a softcore. Then, it uses deep learning to find a relation between the execution time of a given application and the hardware configuration. Using integrated performance counters can highly reduce intrinsic errors of simulation methods due to being tightly coupled to the hardware. By combining the performance estimation technique with static power information of the hardware, we proposed OEPM, a model that can offer the best configuration of softcore in terms of energy consumption for a given C source code. Our results reach the mean prediction error rates of below 1.5% for unseen applications",
            "title": "Publications",
            "url": "/publications.html"
        },
        {
            "tags": "",
            "text": "",
            "title": "Search",
            "url": "/search.html"
        },
        {
            "tags": "",
            "text": "Teaching Assistant Microcontrollers Throughout this course I helped students to code suitably for ARM LPC series microcontrollers. Projects indluce working with GPIOs, serial interfaces, analog peripherals, and DMA. Digital Logic I really liked this course! Electronics One of my favorite materials! Eniac Educational Group Mathematics and Physics I was one of founders of this group. The goal was to give complementary education services to high school students. I taught physics and mathematics to students.",
            "title": "Teaching",
            "url": "/teaching.html"
        },
        {
            "tags": "",
            "text": "",
            "title": "Blog",
            "url": "/blog/index.html"
        },
        {
            "tags": "",
            "text": "Guitar playing Watching action movies Video games",
            "title": "Hobbies",
            "url": "/fun/hobbies.html"
        },
        {
            "tags": "",
            "text": "My Books Hobbies",
            "title": "Fun",
            "url": "/fun/index.html"
        },
        {
            "tags": "",
            "text": "Note: These are my non-professional study interests! Winning by Jack Welch This is the best book ever I have read. Jack Welch is a former CEO of general electric. He is famous for his strcit attitude in leadership. During his period, GE market value increase from $12bn to more than $400bn. He wrote this book not to make profit, and I think this is a key differene with the casual success books in the market. The book starts with a spectacular opening, when Welch defines his own interpretation of winning, and says why you should win. The book has a lot of key factors of how to be a good leader in your organization. However, I think most of them are applicable to our everyday lives. For instance, Welch emphesizes on having candor. He says that only candor can eliminate killing bureaucracies within an organizations. Candor speeds up processes, removes misunderstandings, and increses achievements. I can roughly devide my life into two parts. The days before trying candor and the days after. I believe that my biggest achievements are from the time I started to use candor in my everyday life. It had great impacts both on my career and personal life. You should read the book! Deep Work Project Management Make your bed Time Management",
            "title": "My Books",
            "url": "/fun/mybooks.html"
        },
        {
            "tags": "",
            "text": "Blog Fun",
            "title": "More",
            "url": "/more/index.html"
        }
    ]
}